<?php
// **************************************************************************
//  函數名稱: meal_instruction_checkbox_value()
//  函數功能: 餐點資料-checkbox_value
//  程式設計: Kiwi
//  設計日期: 2021/04/06
// **************************************************************************
function meal_instruction_opt_setup($type, $dataIndex, $index=NULL) {
  if(!is_null($index) and '' == $index) {
    return '';
  }

  switch($type) {
    case "checkbox":
        // 星期                      
      $data["mil_p01"] = array("1" => "星期一",
                               "2" => "星期二",
                               "3" => "星期三",
                               "4" => "星期四",
                               "5" => "星期五",
                               "6" => "星期六",
                               "0" => "星期日",
                               "99" => "無",);

    // 是否要代餐
    $data["mil04"] = array("1" => "有",
                           "2" => "無",
                           "3" => "變更");
      break;
    case "radio":
      // 飯糰          
      $data["mil_m01_1"] = array("1" => "大",
                                 "2" => "中",
                                 "3" => "小",
                                 "99" => "無");
 
      // 菜盒     
      $data["mil_m01_2"] = array("Y" => "有",
                                 "N" => "無");

      // 菜盒內容
      $data["mil_m01_3"] = array("1" => "普通",
                                 "2" => "碎食",
                                 "N" => "無",
                                );

      // 素食
      $data["mil_m01_4"] = array("Y" => "是",
                                 "N" => "否");
      
      // 初一、十五素食
      $data["mil_m01_5"] = array("Y" => "是",
                                 "N" => "否");

      // 代餐狀況
      $data["mil_mp01"] = array("N" => "無",
                                "Y" => "有"); 
                  
      // 代餐種類       
      $data["mil_mp01_type"] = array("1" => "非熟代(葷)",
                                     "2" => "非熟代(素)",
                                     "3" => "熟代(葷)",
                                     "4" => "熟代(素)",
                                     "5" => "米(只要)",
                                     "6" => "每週1米",
                                     "7" => "每週2米",
                                     "8" => "營養包",
                                     "9" => "吐司");
        
      // 是否停復餐
      $data["mil_s01"] = array("N" => "無(不出餐)",
                               "Y" => "有(出餐)");                            

      // 是否為自費戶
      $data["mil_i01"] = array("N" => "否",
                               "Y" => "是");     
      
      // 是否停復餐
      $data["mil_s01_reason"] = array("1" => "出院",
                                      "2" => "住院",      
                                      "3" => "往生",      
                                      "4" => "喘息",      
                                      "5" => "安置",      
                                      "6" => "餐別開案",      
                                      "7" => "餐別結案",      
                                      "8" => "外出",      
                                      "9" => "就醫",      
                                      "99" => "其他");   
      break;
    case "select":
      break;
  }

  if(NULL == $index) {
    return $data[$dataIndex];
  }
  else {
    return $data[$dataIndex][$index];
  }   
}
// **************************************************************************
//  函數名稱: hlp_opt_setup()
//  函數功能: 選項內容
//  程式設計: Kiwi
//  設計日期: 2023/09/02
// **************************************************************************
function hlp_opt_setup($dataIndex, $value=NULL, $format="single", $delimiter=",") {
  if(!is_null($dataIndex) and '' == $dataIndex) {
    return '';
  }

  // 案主資料 Begin //
  // 是否為僅OT個案
  $data["ct00"] = array("Y" => "是",
                        "N" => "否");

  // 是否為僅OT個案
  $data["ct04"] = array("M" => "男",
                        "Y" => "女");

  // 家電狀況
  $data["ct21"] = array("1" => "冰箱",
                        "2" => "電鍋");

  // 居住狀況                      
  $data["ct31"] = array("1" => "獨居",
                        "2" => "有家庭支持",
                        "3" => "失依失聯",
                        "99" => "其他");
 
  // 政府身分別定義，社會局月報表使用                
  $data["ct34_go_sab"] = array("1" => "專案",
                               "2" => "低收",
                               "3" => "中低收",
                               "4" => "低收",
                               "5" => "低收",
                               "6" => "低收"
                              );    

  // 政府定義身分別
  $data["ct34_go"] = array("1" => "一般戶",
                           // "2" => "低收三",
                           "3" => "長照中低收（1.5~2.5倍）",
                           "4" => "長照低收（未達1.5倍）",
                           "5" => "社會救助法低收入戶（未達1倍）",
                           "7" => "社會救助法中低收入戶(1.5~2.5倍)",
                           // "6" => "低收二",
                         ); 

  // 內部定義身分別                      
  $data["ct34_fo"] = array("1" => "獨居身障者",
                           "2" => "榮民",
                           "3" => "原住民",
                           "4" => "獨居老人",
                           "5" => "非獨居老人",
                           "6" => "老農",
                           "7" => "非獨居身障者");

  // 身心障礙手冊
  $data["ct35"] = array("Y" => "有",
                        "N" => "無");

  // 障礙等級                      
  $data["ct35_level"] = array("1" => "輕度",
                              "2" => "中度",
                              "3" => "重度",
                              "4" => "極重度",
                              "99"=>"無");  

  // 障礙類別                      
  $data["ct35_type"] = array("11" => "第一類：神經系統構造及精神、心智功能",
                             "12" => "第二類：眼、耳及相關構造與感官功能及疼痛",
                             "13" => "第三類：涉及聲音與言語構造及其功能",
                             "14" => "第四類：循環、造血、免疫與呼吸系統構造及其功能",
                             "15" => "第五類：消化、新陳代謝與內分泌系統相關構造及其功能",
                             "16" => "第六類：泌尿與生殖系統相關構造及其功能",
                             "17" => "第七類：神經、肌肉、骨骼之移動相關構造及其功能",
                             "18" => "第八類：皮膚與相關構造及其功能",
                             "99"=>"無");
              
  // 健康狀態                      
  $data["ct36"] = array("1" => "身體健康完全無須他人協助",
                        "2" => "身體欠佳，但無需他人協助",
                        "3" => "身體欠佳，部份事項需他人協助",
                        "4" => "身體癱瘓，需他人完全照顧");
  
  // 失能程度                      
  $data["ct37"] = array("1" => "無失能",
                        "2" => "輕度",
                        "3" => "中度",
                        "4" => "重度",
                        "5" => "輕度:IADL失能",
                        "6" => "第一級",
                        "7" => "第二級",
                        "8" => "第三級",
                        "9" => "第四級",
                        "10" => "第五級",
                        "11" => "第六級",
                        "12" => "第七級",
                        "13" => "第八級");
  // 疾病名稱     
  // 20230830之前的版本    
  // $data["ct38_1"] = array("1" => "高血壓",
  //                         "2" => "糖尿病",
  //                         "3" => "心血管疾病~心臟病",
  //                         "4" => "冠狀動脈疾病",
  //                         "5" => "癌症",
  //                         "6" => "呼吸系統疾病",
  //                         "7" => "消化系統疾病",
  //                         "8" => "腎臟病",
  //                         "9" => "痛風",
  //                         "10" => "乳糖不耐症");
    
  // // 疾病名稱            
  // $data["ct38_2"] = array("1" => "中風（左側）",
  //                         "2" => "中風（右側）",
  //                         "3" => "小兒麻痺",
  //                         "4" => "癲癇症",
  //                         "5" => "巴金森氏症",
  //                         "6" => "阿茲海默症",
  //                         "7" => "憂鬱症",
  //                         "8" => "躁鬱症",
  //                         "9" => "肌肉萎縮症");          

  // 疾病名稱            
  // 20230830修正版本    
  // "3" => "心血管疾病~心臟病" => 併入「冠狀動脈疾病（如心絞痛、心肌梗塞、動脈硬化性心臟病）」,
  $data["ct38_1"] = array("1" => "高血壓",
                          "2" => "糖尿病",
                          "4" => "冠狀動脈疾病（如心絞痛、心肌梗塞、動脈硬化性心臟病）",
                          "5" => "癌症（過去五年內）",
                          "6" => "呼吸系統疾病（氣喘、慢性阻塞性肺病、肺炎、呼吸衰竭等）",
                          "7" => "消化系統疾病（肝、膽、腸、胃）",
                          "8" => "泌尿生殖系統疾病（良性攝護腺肥大、腎衰竭等）",
                          "9" => "痛風",
                          "10" => "乳糖不耐症",
                          "11" => "腦血管意外（中風）、暫時性腦部缺血（小中風）",
                          "12" => "心房顫動或其他節律障礙",
                        );

  // 疾病名稱        
  // "1" => "中風（左側）" => 併入疾病1「腦血管意外（中風）、暫時性腦部缺血（小中風）」
  // "2" => "中風（右側）" => 併入疾病1「腦血管意外（中風）、暫時性腦部缺血（小中風）」
  // "8" => "躁鬱症", => 併入精神疾病
  $data["ct38_2"] = array("3" => "小兒麻痺",
                          "4" => "頑性(難治型)癲癇症",
                          "5" => "帕金森氏症",
                          "6" => "失智症",
                          "7" => "精神疾病（思覺失調症、雙極性精神障礙、憂鬱症等）",
                          "9" => "運動神經元疾病（最常見為肌萎縮性脊髓側索硬化症, ALS）",
                          "10" => "骨骼系統（關節炎、骨折、骨質疏鬆症）",
                          "11" => "視覺疾病（白內障、視網膜病變、青光眼或黃斑性退化等）",
                          "12" => "自閉症",
                          "13" => "智能不足(輕度、中度、重度、極重度、其他及非特定智能不足)",
                          "14" => "腦性麻痺",
                          "15" => "脊髓損傷",
                          "16" => "傳染性疾病（疥瘡、肺結核、梅毒、愛滋病等）",
                          "17" => "感染性疾病（過去一個月內）",
                          "18" => "罕見疾病",
                        );
  // 案主資料 End //

  // 開結案服務 Begin //
  // 服務現況
  $data["sec01"] = array("1" => "長照案",
                         "2" => "公所案",
                         "3" => "朝清案",
                         "4" => "自費案",
                         "5" => "其他"
                        );
  
  $data["sec03"] = array("Y" => "是",
                         "N" => "否",
                        );

  // 餐別                     
  $data["sec04"] = array("1" => "午餐",
                         "3" => "晚餐"
                        );

  // 經費來源                     
  $data["sec05"] = array("1" => "長照案",
                         "2" => "公所案",
                         "3" => "朝清案",
                         "4" => "自費案",
                         "5" => "其他"
                        );

  // 繳費方式                     
  $data["sec09"] = array("1" => "志工收費",
                         "2" => "簡訊-匯款",
                         "3" => "簡訊-中心繳費",
                         "4" => "中心繳費",
                         "5" => "儲值代扣-匯款",
                         "6" => "儲值代扣-現金",
                         "7" => "不收費",
                         "8" => "居服代收",
                        );
  // 開結案服務 End //

  // 餐食異動 Begin //
  // 星期                      
  $data["mil_p01"] = array("1" => "星期一",
                           "2" => "星期二",
                           "3" => "星期三",
                           "4" => "星期四",
                           "5" => "星期五",
                           "6" => "星期六",
                           "0" => "星期日",
                           "99" => "無",);

  // 是否要代餐
  $data["mil04"] = array("1" => "有",
                         "2" => "無",
                         "3" => "變更");

  // 飯糰          
  $data["mil_m01_1"] = array("1" => "大",
                             "2" => "中",
                             "3" => "小",
                             "99" => "無");
 
  // 菜盒     
  $data["mil_m01_2"] = array("Y" => "有",
                             "N" => "無");

  // 菜盒內容
  $data["mil_m01_3"] = array("1" => "普通",
                             "2" => "碎食",
                             "N" => "無",
                            );

  // 素食
  $data["mil_m01_4"] = array("Y" => "是",
                             "N" => "否");
      
  // 初一、十五素食
  $data["mil_m01_5"] = array("Y" => "是",
                             "N" => "否");

  // 代餐狀況
  $data["mil_mp01"] = array("N" => "無",
                            "Y" => "有"); 
                  
  // 代餐種類       
  $data["mil_mp01_type"] = array("1" => "非熟代(葷)",
                                 "2" => "非熟代(素)",
                                 "3" => "熟代(葷)",
                                 "4" => "熟代(素)",
                                 "5" => "米(只要)",
                                 "6" => "每週1米",
                                 "7" => "每週2米",
                                 "8" => "營養包",
                                 "9" => "吐司");
        
  // 是否停復餐
  $data["mil_s01"] = array("N" => "無(不出餐)",
                           "Y" => "有(出餐)");                            

  // 是否為自費戶
  $data["mil_i01"] = array("N" => "否",
                           "Y" => "是");     
      
  // 是否停復餐
  $data["mil_s01_reason"] = array("1" => "出院",
                                  "2" => "住院",      
                                  "3" => "往生",      
                                  "4" => "喘息",      
                                  "5" => "安置",      
                                  "6" => "餐別開案",      
                                  "7" => "餐別結案",      
                                  "8" => "外出",      
                                  "9" => "就醫",      
                                  "99" => "其他"); 
  // 餐食異動 End //

  // 路線資料 Begin //
  $data['reh03'] = array("1" => "東草屯",
                         "2" => "西草屯",
                         "3" => "南草屯",
                         "4" => "北草屯",
                         "5" => "市中心"
                        );

  $data['reh05'] = array("1" => "午餐",
                         "2" => "晚餐",
                        );

  $data['reh07'] = array("1" => "白色",
                         "2" => "綠色",
                         "3" => "黃色",
                        );
  // 路線資料 End //

  $data['mil02'] = array('3' => "停復餐",
                         '1' => "餐點",
                        //  '2' => "代餐",
                         '4' => "固定暫停",
                         '5' => "自費",
                         '6' => "一次性出餐異動"
                       );

  $data['mlo_dt02'] = array("1" => "送餐-便當",
                            "2" => "送餐-代餐",
                            "3" => "補上班",
                            "4" => "不送餐",
                            );

  // 印領清冊excel的月份 Begin //
  $data['rpt_se01'] = array("1" => "一",
                            "2" => "二",
                            "3" => "三",
                            "4" => "四",
                            "5" => "五",
                            "6" => "六",
                            "7" => "七",
                            "8" => "八",
                            "9" => "九",
                            "10" => "十",
                            "11" => "十一",
                            "12" => "十二",
                            );
  // 印領清冊excel的月份 End //

  // 印領清冊長照案sample excel 個欄位像素 Begin //
  $data['rpt_se02'] = array('A' => 196,
                            'B' => 412,
                            'C' => 444,
                            'D' => 380,
                            'E' => 168,
                            'F' => 636,
                            'G' => 944,
                            'H' => 468,
                            'I' => 276,
                            'J' => 200,
                            'K' => 260,
                            'L' => 288,
                            'M' => 372,
                            'N' => 328,
                            );
  // 印領清冊長照案sample excel 個欄位像素 End //

  // 印領清冊朝清案sample excel 個欄位像素 Begin //
  $data['rpt_se03'] = array('A' => 46,
                            'B' => 85,
                            'C' => 105,
                            'D' => 61,
                            'E' => 110,
                            'F' => 314,
                            'G' => 121,
                            'H' => 65,
                            'I' => 58,
                            'J' => 91,
                            'K' => 103,
                            );
  // 印領清冊朝清案sample excel 個欄位像素 End //

  // 印領清冊公所案sample excel 個欄位像素 Begin //
  $data['rpt_se04'] = array('A' => 46,
                            'B' => 86,
                            'C' => 106,
                            'D' => 61,
                            'E' => 120,
                            'F' => 299,
                            'G' => 160,
                            'H' => 66,
                            'I' => 97,
                            'J' => 91,
                            'K' => 101,
                            );
  // 印領清冊公所案sample excel 個欄位像素 End //

  // 印領清冊ct_il02 Begin //
  // $data['rpt_se04'] = array('1' => "1",
  //                           '3' => "3",
  //                           '4' => "4",
  //                           '5' => "5",
  //                           '7' => "7",
  //                           );
  // 印領清冊ct_il02 End //

  // 人數人次excel路線行 Begin //
    $data['rpt_sc01'] = array('1' => "A",
                              '2' => "B",
                              '3' => "C",
                              '4' => "D",
                              '5' => "E",
                              '6' => "F",
                              '7' => "G",
                              '8' => "H",
                              '9' => "I",
                              '10' => "J",
                              '11' => "K",
                              '12' => "L",
                              '13' => "M",
                              '14' => "N",
                              );
  // 人數人次excel路線行 End //

  $res = NULL;
  switch($format) {
    case "get":
      $res = $data[$dataIndex];
      break;
    case "single":
      if(empty($value)) {
        $res = '';
      }
      else {
        $res = isset($data[$dataIndex][$value]) ? $data[$dataIndex][$value] : '';
      }
      break;
    case "multiple":
      if(empty($value)) {
        $res = '';
      }
      else {
        $return_str_array = [];
        $multiple_value_array = explode($delimiter, $value);
        if(!empty($multiple_value_array)) {
          foreach ($multiple_value_array as $each_value) {
            if($each_value == 0) {
              continue;
            }
            if(isset($data[$dataIndex][$each_value])) {
              $return_str_array[] = $data[$dataIndex][$each_value];
            }
          }
        }
  
        $res = join($delimiter, $return_str_array);
      }
      break;
  }

  return $res;
}
?>